gap> G := Group([ (1,6)(2,7)(3,8)(4,5),(1,2),(1,3),(2,3),(6,7),(6,8),(7,8) ]); # generators
Group([ (1,6)(2,7)(3,8)(4,5), (1,2), (1,3), (2,3), (6,7), (6,8), (7,8) ])
gap> StructureDescription( G ); # G is (S3 x S3) : C2, i.e. C2 \ltimes S_3^2 = Sym(3) \wr C2
"(S3 x S3) : C2"
gap> W := WreathProduct( SymmetricGroup(3), Group([ (1,2) ]) );
Group([ (1,2,3), (1,2), (4,5,6), (4,5), (1,4)(2,5)(3,6) ])
gap> IsomorphismGroups( G, W ); # verify it is wreath product
[ (1,6)(2,7)(3,8)(4,5), (1,2), (1,3), (2,3), (6,7), (6,8), (7,8) ] -> [ (1,3), (1,6)(2,5)(3,4), (1,4)(2,6)(3,5),
  (1,5)(2,4)(3,6), (1,4)(2,5)(3,6), (1,5)(2,6)(3,4), (1,6)(2,4)(3,5) ]